'''
Реализовать следующие функции рекурсивно:
1. Вывод бинарного представления числа
2. Умножение
3. Возведение в степень
'''
#1. Вывод бинарного представления числа
n = 57

def binar(k, a = []):
    if k != 0:
        a.insert(0, str(k%2))
        k = k//2
        binar(k, a)
    return a
#ответ
print(''.join(binar(n)))
# для проверки
a = []
print(format(n, 'b') == ''.join(binar(n, a)))
print('_____________________________________________________')
##########################################################
#2. Умножение
a1 = 5
b1 = 2
def AxB (A, B, X = 0):
    while A > 0:
        X += B
        A -=1
        AxB (A, B, X)
    return(X)
#ответ
print(AxB (a1, b1))
# для проверки
print(AxB (a1, b1) == a1*b1)
print('_____________________________________________________')
###############################################################
#3. Возведение в степень
a1 = 4
b1 = 2
def A_power_B (A, B, X = 1):
    while B > 0:
        X *= A
        B -=1
        A_power_B (A, B, X)
    return(X)
print(A_power_B(a1, b1))
# для проверки
print(A_power_B(a1, b1) == a1**b1)
print('_____________________________________________________')

    


